# Accessing elements in pandas dataframes

In [2]:
import pandas as pd

In [46]:
# Creating a store items dataframe from a dictionary

items = [{'bikes':20,'pants':30,'watches':35},{'watches':10,'glasses':50,'bikes':5,'pants':23}]

store_items = pd.DataFrame(items, index=['store 1','store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2      5     23       10     50.0

We can access elements in Pandas DataFrames in many different ways. In general, we can access rows, columns, or individual elements of the DataFrame by using the row and column labels.

In [8]:
print('No of bikes in each store: \n', store_items['bikes'])
print()
print('No of bikes and pants in each store: \n',store_items[['bikes','pants']])
print()
print('Items in store 1: \n', store_items.loc['store 1'])
print()
print('No of bikes in store 2: \n', store_items['bikes']['store 2'])

No of bikes in each store:
 store 1    20
store 2     5
Name: bikes, dtype: int64

No of bikes and pants in each store:
          bikes  pants
store 1     20     30
store 2      5     23

Items in store 1:
 bikes      20.0
pants      30.0
watches    35.0
glasses     NaN
Name: store 1, dtype: float64

No of bikes in store 2:
 5

We can also modify our DataFrames by adding rows or columns.

In [9]:
# We add a new column named shirts to our store_items dataframe indicating the number of shirts in stock at each store

store_items['shirts'] = [22,54]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      22
store 2      5     23       10     50.0      54

We can also add new columns to our DataFrame by using arithmetic operations between other columns in our DataFrame

In [10]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      22     52
store 2      5     23       10     50.0      54     77

To add rows to our DataFrame we first have to create a new Dataframe and then append it to the original DataFrame.

In [19]:
new_items = {'bikes':50,'pants':22,'watches':58,'glasses':21}
new_store = pd.DataFrame(new_items,index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     50     22       58       21

In [22]:
store_items = store_items.append(new_store)
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    22.0   52.0
store 2      5     23       10     50.0    54.0   77.0
store 3     50     22       58     21.0     NaN    NaN

We add a new column using data from particular rows in the watches column

In [24]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    22.0   52.0          NaN
store 2      5     23       10     50.0    54.0   77.0         10.0
store 3     50     22       58     21.0     NaN    NaN         58.0

We insert a new column with label shoes right before the column with numerical index 4

In [27]:
store_items.insert(4,'ties',[8,5,10])
store_items

,bikes,pants,watches,glasses,ties,shoes,shirts,suits,new_watches
store 1,20,30,35,NaN,8,8,22.0,52.0,NaN
store 2,5,23,10,50.0,5,5,54.0,77.0,10.0
store 3,50,22,58,21.0,10,10,NaN,NaN,58.0

In [29]:
# Remove a column
store_items.pop('new_watches')
store_items

         bikes  pants  watches  glasses  ties  shoes  shirts  suits
store 1     20     30       35      NaN     8      8    22.0   52.0
store 2      5     23       10     50.0     5      5    54.0   77.0
store 3     50     22       58     21.0    10     10     NaN    NaN

In [36]:
# Remove mulltiple columns
store_items = store_items.drop(['suits','ties'],axis=1)
store_items

         bikes  pants  watches  glasses  shoes  shirts
store 1     20     30       35      NaN      8    22.0
store 2      5     23       10     50.0      5    54.0
store 3     50     22       58     21.0     10     NaN

In [37]:
# Remove store 1 and store 2 rows
store_items = store_items.drop(['store 1','store 2'],axis=0)
store_items

         bikes  pants  watches  glasses  shoes  shirts
store 3     50     22       58     21.0     10     NaN

In [40]:
# Rename column label from bikes to hats
store_items = store_items.rename(columns={'bikes':'hats', 'glasses':'belts'})
store_items

         hats  pants  watches  belts  shoes  shirts
store 3    50     22       58   21.0     10     NaN

In [42]:
# Rename a row label
store_items = store_items.rename(index={'store 3':'jellys'})
store_items

        hats  pants  watches  belts  shoes  shirts
jellys    50     22       58   21.0     10     NaN

In [47]:
# We change the row index to be the data in the shoes column
# store_items = store_items.set_index('shoes')
# store_items

store_items = store_items.set_index('pants')
store_items

       bikes  watches  glasses
pants
30        20       35      NaN
23         5       10     50.0